app/controllers/friends_controller.rb

INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "insta", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save

UPDATE "friends" SET "email" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["email", "kiranvellanki1005@gmail.com"], ["updated_at", "2022-10-22 15:35:58.691829"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)